src/wsdl/HelloService.wsdl

<definitions name="HelloWorldService"
    targetNamespace="http://www.examples.com/wsdl/HelloService.wsdl"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:tns="http://www.examples.com/wsdl/HelloService.wsdl"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">

    <message name="SayHelloRequest">
      <part name="name" type="xsd:string"/>
    </message>

    <message name="SayHelloResponse">
      <part name="greeting" type="xsd:string"/>
    </message>

    <portType name="HelloWorldPortType">
      <operation name="sayHello">
        <input message="tns:SayHelloRequest"/>
        <output message="tns:SayHelloResponse"/>
      </operation>
    </portType>

    <binding name="HelloWorldBinding" type="tns:HelloWorldPortType">
      <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
      <operation name="sayHello">
        <soap:operation soapAction="sayHello"/>
        <input>
          <soap:body use="literal"/>
        </input>
        <output>
          <soap:body use="literal"/>
        </output>
      </operation>
    </binding>

    <service name="HelloWorldService">
      <port name="HelloWorldPort" binding="tns:HelloWorldBinding">
        <soap:address location="http://localhost:8000/hello"/>
      </port>
    </service>
</definitions>